// знайти суму парних елементів матриці над головною діагоналлю
#include <ctime> // сума парних елементів матриці над головною діагоналлю
#include <iostream>
using namespace std;

int main() {
  int a[10][10], i, j, n, m, sum = 0;
  srand(time(0));
  cout << "n ="; // кількість рядків повинні = стовпцям
  cin >> n;
  cout << "m ="; // кількість стовпців повинні = рядкам
  cin >> m;

  for (i = 0; i < n; i++)
    for (j = 0; j < m; j++)
      a[i][j] = rand() % 10; // заповнюємо масив випадковими числами

  for (i = 0; i < n; i++) { // виводимо масив
    for (j = 0; j < m; j++)
      cout << a[i][j] << " ";
    cout << endl;
  }
  for (i = 0; i < n; i++) {
    for (j = 0; j < m; j++)
      if (a[i][j] % 2 == 0 && i < j) // парні елементи матриці над
                                     // головною діагоналлю
        sum = sum + a[i][j];
  }
  cout << "Сума парних елементів матриці над головною діагоналлю: " << sum
       << endl;

  return 0;
}