/*Напишіть програму яка при ділення на 4 дає залишок 3, числа вводить користувач з клавіатури*/
#include <iostream>
using namespace std;

int main() {
    int num[5];
    for (int i = 0; i < 5; i++) {
        cout << "Введіть число: ";
        cin >> num[i];
        if (num[i] % 4 == 3) {
            cout <<"Введене число ділиться на 4 з залишком 3: " << num[i] << "\n";
        }
        else {
            cout <<"Введене число не ділиться на 4 з залишком 3: " << num[i] << "\n";
        }
    }
   
    return 0;
}
